{
    "created": "03-13-2023",
    "updated": "03-13-2023",
    "title": "College Mathematics",
    "description": "A brief summary of the mathematics courses I took at the University of Washington Bothell.",
    "type": "other",
    "tags": [
        "college",
        "math",
        "summary"
    ],
    "status": "ongoing",
    "programming_languages": [],
    "language": "english",
    "splash_image": "",
    "splash_image_alt": "nothing",
    "perma-link": "f",
    "pages": [
        {
            "type": "h4",
            "content": "Reflection",
            "sections": [
                {
                    "type": "body1",
                    "content": "This is a reflection on my experience with mathematics in college. The following is a list of classes I've taken."
                },
                {
                    "type": "markdown",
                    "content": " - STMATH 126 - Calculus 3 - Honestly sorta sucked freshman year, but I guess it focused more on series type data.\n - STMATH 300 - Foundations of Modern Math - An introduction proofs class. I wish I took this class, and decided against the double major. Proofs are not really that relevant to programming and are more of a niche theoretical field.\n - STMATH 308 - Matrix Algebra - They skipped linear algebra and went straight for matrix algebra, though great for 3D graphics. I wish I took the proofs class before this though, since I mostly learned it through a less intuitive way and things didn't click untill later.\n - STMATH 381 - Discrete Mathematics - Gotta be honest, this seems like a basic algorithms course. Covered algorithms like Kruskal's, Primm's, Dijkstra's, Markov Chains, and a few other very niche specific algorithms and applying them to irregular data sets. It seems like useful practice for modelling human world applications on computers.\n - STMATH 405 & 406 - Numerical Analysis I & II - This was a difficult class. It focused on a wide variety of topics like floating point error and generating line fitting curves. Seems useful for graphical data plotting applications\n - 409 - Advanced Linear Algebra - Pretty much standard college level linear algebra mixed with heavy amounts of proofs.\n - STMATH 424 - Real Analysis - Don't remember too well, but this was also really difficult. It was about looking at finite, infinite, and other forms of data and sort of doing a deep dive proofs of different subjects within math.\n - STMATH 324 - Multi-variable Calculus - I think this was more about mapping surfaces to formulas and understanding them I guess.\n - STMATH 341 - Statistics - This class was poorly structured and all online. Pretty much just applied a bunch of different statistics methods to different datasets based on analysis of the problem. Not sure I remember what algorithms I used and why."
                },
                {
                    "type": "body1",
                    "content": "Math is weird. It's like a useful thing to have and understand, but also not absolutely necessary to understand certain problems. I could make a full stack webpage with only basic addition and subtraction. I can't if I'm integrating low level 3D graphics pipelines or data analysis graphics that are generated with my own code and not using middleware solutions."
                },
                {
                    "type": "body1",
                    "content": "It's really a hit or miss for everyone. I only took it for the opportunity to learn linear algebra, so I could get more familiar with matrix operations and 3D graphics."
                }
            ]
        }
    ]
}