{
    "created": "12-6-2022",
    "updated": "12-6-2022",
    "title": "Portfolio",
    "description": "A portfolio to showcase some stuff. It's currently a work in progress, since I need to revise structures of my webpage to allow for a portfolio style document.",
    "type": "other",
    "tags": [
        "general",
        "portfolio"
    ],
    "status": "ongoing",
    "programming_languages": [],
    "language": "english",
    "splash_image": "",
    "splash_image_alt": "na",
    "perma-link": "portfolio",
    "pages": [
        {
            "type": "h3",
            "content": "Webpage Warning",
            "sections": [
                {
                    "type": "markdown",
                    "content": "I'm adding this warning here, since I might link this page directly. There are some issues with the webpage you might encounter. They are listed below..\n- Mobile devices window increasing when changing pages\n- Poor page transitions (disabled for big screens)\n- Poor line spacing\n- General poor sizing and word wrap for small monitors\n- Note to myself: Add navigation headers that don't render a title"
                }
            ]
        },
        {
            "type": "h3",
            "content": "Objective",
            "sections": [
                {
                    "type": "h6",
                    "content": "BS in Computer Science and Mathematics"
                },
                {
                    "type": "markdown",
                    "content": " _University of Washington Bothell, WA, 2018-2022_\n- Annual Dean's List 2018-2021\n- GPA: 3.67"
                }
            ]
        },
        {
            "type": "h3",
            "content": "Resume",
            "sections": [
                {
                    "type": "pdf",
                    "title": "Resume",
                    "content": "Resume.pdf"
                },
                {
                    "type": "body1",
                    "content": "Note: I don't normally pick up phone calls unless someone messages me first through email. The reason for that is because I don't know who's a spam caller or not. I don't know why, but I've even recieved phone calls from people speaking only Chinese asking why I'm not at work. I don't speak Chinese, and I've never worked at a restaurant."
                },
                {
                    "type": "h4",
                    "content": "List of Courses",
                    "sections": [
                        {
                            "type": "markdown",
                            "content": "A list of courses I've taken.\n- Intro to Game Development - made C# network FPS game\n- Parallel Distributed Computing - Java with threading and Linux machines\n- Abstract Algebra I & II - painful math proofs\n- Physics - Electromagnetic and Oscillation Motions\n- Numerical Analysis I & II - general error anaylysis, regressions, and approximations using floating point data\n- Financial Mathematics - Loans, interest, and bond calculations\n- Physics - Mechanics\n- Multivariable Calculus\n- Computer Science Capstone - ORM Web tool\n- Real Analysis\n- Discrete Mathematics - Mostly just graph algorithms (e.g. Dijkstra's, Markov Chains, Prim's Algorithm, etc...)\n- Statistical Inference - Not sure, but used R to simplify the calculations\n- Advanced Linear Algebra - Linear algebra but with proofs\n- Intro to Diffierential Equations\n- Database Systems - relational database design and creationg in MySQL\n- Machine Intelligence - Mostly explored audio pre-processing and training. Was mostly unsuccessful.\n- 3D Computer Graphics - Basic 3D Unity stuff\n- Hardware and Computer Organization - writing assembly code\n- Operating Systems - processes or something\n- Undergraduate Research (Spatial Analysis of people before and after covid through Geolocation data) - worked on collecting social media data\n- Foundations to Modern Math - math proofs\n- Data, Algorithms, and Math I & II - C++ programming\n- Analysis and Design - Software architecture/patterns\n- Signal Computing - pain\n- Management Principles\n- K12 Computing Education - taught kids at middle school\n- Calculus III\n- Intro to Drawing\n- Matrix Algebra - linear algebra, but dumber\n- Intro to Buisness Statistics - statistics, but using excel\n- Intro to Cybersecurity - no, don't download viruses on your pc\n- Computer Programming II - Java\n- Visual Literary Performing Arts I & II - writing\n- AP CS A\n- AP US History\n- AP World History\n- AP Math AB"
                        }
                    ]
                }
            ]
        },
        {
            "type": "h3",
            "content": "Samples",
            "sections": [
                {
                    "type": "body1",
                    "content": "Samples of my work. TODO: dig up old projects."
                }
            ]
        },
        {
            "type": "h3",
            "content": "About Me",
            "sections": [
                {
                    "type": "body1",
                    "content": "I am a graduate from the University of Washington Bothell with a bachelor of science in computer science and mathematics looking to apply my skills and passion for programming in an entry-level position. I spent the last five years programming since high school, and I've learned to pick up countless programming languages and apply myself to varying projects. I'm a little slow at times, but I'm capable of exploring and learning things on my own with minimal oversight."
                },
                {
                    "type": "h6",
                    "content": "Short Term Goals",
                    "sections": [
                        {
                            "type": "body1",
                            "content": "Aside from job hunting (which I'm struggling quite a bit in), I've been applying myself into real time rendering and full stack webpage design. This is all for my end goal of making a video game from near scratch"
                        }
                    ]
                },
                {
                    "type": "h6",
                    "content": "Long Term Goals",
                    "sections": [
                        {
                            "type": "body1",
                            "content": "In about 5 or 10 years from now, I at least hope that I'll continue to work on projects that interest me. Making cool webpages, developing databases, or maybe even just hashing out features that I think would be cool and funny to add."
                        }
                    ]
                }
            ]
        }
    ]
}